"use strict";

//let x = 5;
//alert(x++);
//Выведет 5 тк инеремент в постфиксной форме



//[] + false + null + true;
//Выведет значение NaN 



//let y = 1;
//let x = y = 2;
//alert(x);
//Выведет 2



//[] + 1 + 2;
//Выведет 12 тк [] при конкатинации выдаёт пустую строку ""



//alert("1"[0]);
//Выведет 1 тк в строке "1" нулевым элементом является 1



//2 && 1 && null && 0 && undefined;
//Оператор && "И" запинается на лжи (в этом случае на null)
//Оператор || "ИЛИ" запинается на правде 



//console.log(!!(a && b) === (a && b));
//Выведет false тк !! превращает в булийное 



// alert(null || 2 && 3 || 4);
// Выведет 3 тк && приоритетнее чем ||
// PS смотри таблицу приоритетов операторов JS



// const a = [1, 2, 3];
// const b = [1, 2, 3];
// a == b;
//Массив a не равен массиву b тк это разные элементы с похожими данными 



// alert(+'infinity');
// Выведет infinity но в числовом типе 



// colsole.log("Ёжик" > "яблоко");
// Смотри приоритеты букв 



// console.log(0 || "" || 2 || undefined || true || false);
// Выведет 2 тк "Оператор || "ИЛИ" запинается на правде"

